In [72]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

# PANDAS CHEET SHEET

## CREATING DATAFRAMES
     * df = pd.DataFrame-Specify values for each column.
     * df = pd.DataFrame-Specify values for each row.
     * df = pd.DataFrame-Create DataFrame with a MultiIndex

In [73]:
# Specify values for each column.
df = pd.DataFrame(
                 {"a" : [4, 5, 6], 
                "b" : [7, 8, 9], 
                "c" : [10, 11, 12]},)

In [74]:
df

   a  b   c
0  4  7  10
1  5  8  11
2  6  9  12

In [75]:
# Specify values for each row.
df1 = pd.DataFrame(
                 {"a" : [4, 5, 6], 
                "b" : [7, 8, 9], 
                "c" : [10, 11, 12]},)

In [76]:
df1

   a  b   c
0  4  7  10
1  5  8  11
2  6  9  12

In [77]:
## u have change and add the cloum names
# Specify values for each row.

df.columns=['dhana','kd','hari']

In [78]:
df

   dhana  kd  hari
0      4   7    10
1      5   8    11
2      6   9    12

In [79]:
# Create DataFrame with a MultiIndex
df2 = pd.DataFrame(
{"dhana" : [4 ,5, 6], 
"kd" : [7, 8, 9], 
"hari" : [10, 11, 12]}, 
index = pd.MultiIndex.from_tuples(
[('0', 1), ('1', 2),
('2', 2)], names=['sri', 'loki']))

In [80]:
df2

          dhana  kd  hari
sri loki
0   1         4   7    10
1   2         5   8    11
2   2         6   9    12

## RESHAPING DATA – Change layout, sorting, reindexing, renaming
    * pd.melt(df) -Gather columns into rows.
    * df.pivot(columns='var', values='val') - Spread rows into columns.
    * pd.concat([df1,df2]) -Append rows of DataFrames
    * pd.concat([df1,df2], axis=1)-Append columns of DataFrames
    * df.sort_values('mpg')-Order rows by values of a column (low to high).
    * df.sort_values('mpg’, ascending=False)-Order rows by values of a column (high to low).
    * df.rename(columns = {'y':'year'})-Rename the columns of a DataFrame
    * df.sort_index()-Sort the index of a DataFrame
    * df.reset_index()-Reset index of DataFrame to row numbers, moving index to columns.
    * df.drop(columns=['Length’, 'Height'])-Drop columns from DataFrame

In [81]:
df

   dhana  kd  hari
0      4   7    10
1      5   8    11
2      6   9    12

In [82]:
df1

   a  b   c
0  4  7  10
1  5  8  11
2  6  9  12

In [83]:
#Gather columns into rows
pd.melt(df)

  variable  value
0    dhana      4
1    dhana      5
2    dhana      6
3       kd      7
4       kd      8
5       kd      9
6     hari     10
7     hari     11
8     hari     12

In [84]:
# Spread rows into columns.
df.pivot(columns='dhana', values='kd')

dhana    4    5    6
0      7.0  NaN  NaN
1      NaN  8.0  NaN
2      NaN  NaN  9.0

In [85]:
# Append columns of DataFrame
pd.concat([df,df1])

   dhana   kd  hari    a    b     c
0    4.0  7.0  10.0  NaN  NaN   NaN
1    5.0  8.0  11.0  NaN  NaN   NaN
2    6.0  9.0  12.0  NaN  NaN   NaN
0    NaN  NaN   NaN  4.0  7.0  10.0
1    NaN  NaN   NaN  5.0  8.0  11.0
2    NaN  NaN   NaN  6.0  9.0  12.0

In [86]:
# axis=1 it is called as row 
# Append columns of DataFrames
pd.concat([df,df1], axis=1)

   dhana  kd  hari  a  b   c
0      4   7    10  4  7  10
1      5   8    11  5  8  11
2      6   9    12  6  9  12

In [87]:
# axis=0  it is called as cloumns
pd.concat([df,df1], axis=0)

   dhana   kd  hari    a    b     c
0    4.0  7.0  10.0  NaN  NaN   NaN
1    5.0  8.0  11.0  NaN  NaN   NaN
2    6.0  9.0  12.0  NaN  NaN   NaN
0    NaN  NaN   NaN  4.0  7.0  10.0
1    NaN  NaN   NaN  5.0  8.0  11.0
2    NaN  NaN   NaN  6.0  9.0  12.0

In [88]:
# Order rows by values of a column (low to high)
df.sort_values('hari')

   dhana  kd  hari
0      4   7    10
1      5   8    11
2      6   9    12

In [89]:
# Order rows by values of a column (high to low).
df.sort_values('hari', ascending=False)

   dhana  kd  hari
2      6   9    12
1      5   8    11
0      4   7    10

In [90]:
# u have to rename the kd to replace gayu 
df=df.rename(columns={'kd': 'gayu'})

In [91]:
df

   dhana  gayu  hari
0      4     7    10
1      5     8    11
2      6     9    12

In [92]:
df4 = pd.DataFrame([1, 2, 3, 4, 5], index=[100, 29, 234, 1, 150] ,
                   columns=['A'])

In [93]:
df4  # if the output is not in oder

     A
100  1
29   2
234  3
1    4
150  5

In [94]:
# Sort the index of a DataFrame
df4.sort_index()

     A
1    4
29   2
100  1
150  5
234  3

In [95]:
# Reset index of DataFrame to row numbers, moving index to columns.
df4.reset_index()

   index  A
0    100  1
1     29  2
2    234  3
3      1  4
4    150  5

In [96]:
# Drop columns from DataFrame
df.drop(['dhana'],axis=1)

   gayu  hari
0     7    10
1     8    11
2     9    12

In [97]:
df1 = pd.DataFrame(
                   {"a" : [5, 6, 7], 
                    "b" : [7, 8, 9], 
                    "c" : [10, 11, 12]}, )

In [98]:
df1

   a  b   c
0  5  7  10
1  6  8  11
2  7  9  12

## SUBSET OBSERVATIONS-ROW
    * df[df.Length > 7] -Extract rows that meet logical criteria
    * df.drop_duplicates()-Remove duplicate rows (only considers columns)
    * df.sample(frac=0.5) - Randomly select fraction of rows. 
    * df.sample(n=10) - Randomly select n rows.
    * df.nlargest(n, 'value’)-Select and order top n entries.
    * df.nsmallest(n, 'value')-Select and order bottom n entries.
    * df.head(n)-Select first n rows.
    *df.tail(n)-Select last n row

In [99]:
df5 = pd.DataFrame({
                   'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
                   'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
                   'rating': [4, 4, 3.5, 15, 5]})

In [100]:
df5 # yum,cup, 4  are duplicate values

     brand style  rating
0  Yum Yum   cup     4.0
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [101]:
# Remove duplicate rows (only considers columns).
df5.drop_duplicates()

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [102]:
#Randomly select fraction of rows
df1.sample(frac=0.5)

   a  b   c
0  5  7  10
2  7  9  12

In [103]:
# Randomly select n rows
df1.sample(n=1)

   a  b   c
0  5  7  10

In [104]:
# Select and order top n entries. start from 6,5,4 
df.nlargest(3, 'dhana')

   dhana  gayu  hari
2      6     9    12
1      5     8    11
0      4     7    10

In [105]:
#  Select and order bottom n entries

df.nsmallest(3, 'dhana')

   dhana  gayu  hari
0      4     7    10
1      5     8    11
2      6     9    12

In [106]:
# Select first n rows.
df.head(1)

   dhana  gayu  hari
0      4     7    10

In [107]:
# Select last n rows
df.tail(1)

   dhana  gayu  hari
2      6     9    12

## SUBSET VARIABLE - COLUMNS
    * df[['width’, 'length’, 'species']]-Select multiple columns with specific names.
    * df['width'] or df.width-Select single column with specific name.
    * df.filter(regex='regex')-Select columns whose name matches regular expression regex.

## USING QUERY 
    * query() allows Boolean expressions for filtering rows.
    * df.query('Length > 7')
    * df.query('Length > 7 and Width < 8')
    * df.query('Name.str.startswith("abc")', engine="python")

## SUBSET VARIABLE - ROW AND COLUMNS
    * Use df.loc[] and df.iloc[] - to select only rows, only columns or both.
    * Use df.at[] and df.iat[] to access a single value by row and column.First index selects rows, second index columns.
    * df.iloc[10:20]-Select rows 10-20.
    * df.iloc[:, [1, 2, 5]]-Select columns in positions 1, 2 and 5 (first column is 0).
    * df.loc[:, 'x2':'x4']-Select all columns between x2 and x4 (inclusive).
    * df.loc[df['a'] > 10, ['a’, 'c']]- Select rows meeting logical condition, and only the specific columns .
    * df.iat[1, 2] Access single value by index
    * df.at[4, 'A'] Access single value by label

In [108]:
# to select only rows, only columns or both.
df.loc[0]

dhana     4
gayu      7
hari     10
Name: 0, dtype: int64

In [109]:

df.iloc[0]

dhana     4
gayu      7
hari     10
Name: 0, dtype: int64

In [110]:
df.iloc[0:3]

   dhana  gayu  hari
0      4     7    10
1      5     8    11
2      6     9    12

In [111]:
# Access a single value for a row/column label pair
df.at[1,'gayu']

8

In [112]:
# Access a single value for a row/column pair by integer position.
df.iat[1,2]

11